/*
 * Project platform
 *
 * Class ProtocolErrorCode.java
 * 
 * Version 1.0.0
 * 
 * Creator 
 * CreateAt 2012-9-5 上午11:47:07
 *
 * ModifiedBy 无
 * ModifyAt 无
 * ModifyDescription 无
 * 
 * Copyright (c) 2009-2012 亿鑫新能源 版权所有
 */
package com.yixin.A1000.comm.protocol;

/**
 * 协议错误代码 协议格式错误<br />
 * 0100001 - 协议格式错误：协议长度不足<br />
 * <br />
 * 
 * ID校验错误<br />
 * 0101001 - ID校验错误：ID不合法<br />
 * 0101002 - ID校验错误：ID不存在<br />
 * 0101003 - ID校验错误：CMA与所辖状态监测装置不匹配<br />
 * 0101004 - ID校验错误：状态监测装置与被监测设备不匹配<br />
 * <br />
 * 
 * 数据格式错误<br />
 * 0102001 - 数据格式错误：时间格式错误<br />
 * 0102002 - 数据格式错误：数据无法转换至对应格式<br />
 * <br />
 * 数据内容错误<br />
 * 0103001 - 数据内容错误：监测类型与监测参数不一致<br />
 * 0103002 - 数据内容错误：监测类型不存在<br />
 * 0103003 - 数据内容错误：监测参数不存在<br />
 * 0103004 - 数据内容错误：监测参数缺失<br />
 * 0103005 - 数据内容错误：数据不符合业务规范<br />
 * <br />
 * 动态图片上传错误<br />
 * 0104001 - 动态图片上传错误：静态图片片段过大<br />
 * 0104002 - 动态图片上传错误：静态图片片段损坏<br />
 * 0104003 - 动态图片上传错误：静态图片片段丢失<br />
 * 0104004 - 动态图片上传错误：静态图片校验不成功<br />
 * <br />
 * 未知错误类型<br />
 * 99xxxxx - 未知错误类型<br />
 * 
 * @version v1.0.0
 * @author 
 */
public enum ProtocolErrorCode {
	/** 协议格式错误*/
	ERROR_0100001("0100001", "协议格式错误"),
	/** 协议格式错误：协议长度不足 */
	ERROR_0100002("0100002", "协议格式错误：协议长度不足"),

	/** ID校验错误：ID不合法 */
	ERROR_0101001("0101001", "ID校验错误：ID不合法"),
	/** ID校验错误：ID不存在 */
	ERROR_0101002("0101002", "ID校验错误：ID不存在"),
	/** ID校验错误：CMA与所辖状态监测装置不匹配 */
	ERROR_0101003("0101003", "ID校验错误：CMA与所辖状态监测装置不匹配"),
	/** ID校验错误：状态监测装置与被监测设备不匹配 */
	ERROR_0101004("0101004", "ID校验错误：状态监测装置与被监测设备不匹配"),

	/** 数据格式错误：时间格式错误 */
	ERROR_0102001("0102001", "数据格式错误：时间格式错误"),
	/** 数据格式错误：数据无法转换至对应格式 */
	ERROR_0102002("0102002", "数据格式错误：数据无法转换至对应格式"),

	/** 数据内容错误：监测类型与监测参数不一致 */
	ERROR_0103001("0103001", "数据内容错误：监测类型与监测参数不一致"),
	/** 数据内容错误：监测类型不存在 */
	ERROR_0103002("0103002", "数据内容错误：监测类型不存在"),
	/** 数据内容错误：监测参数不存在 */
	ERROR_0103003("0103003", "数据内容错误：监测参数不存在"),
	/** 数据内容错误：监测参数缺失 */
	ERROR_0103004("0103004", "数据内容错误：监测参数缺失"),
	/** 数据内容错误：数据不符合业务规范 */
	ERROR_0103005("0103005", "数据内容错误：数据不符合业务规范"),

	/** 动态图片上传错误：静态图片片段过大 */
	ERROR_0104001("0104001", "动态图片上传错误：静态图片片段过大"),
	/** 动态图片上传错误：静态图片片段损坏 */
	ERROR_0104002("0104002", "动态图片上传错误：静态图片片段损坏"),
	/** 动态图片上传错误：静态图片片段丢失 */
	ERROR_0104003("0104003", "动态图片上传错误：静态图片片段丢失"),
	/** 动态图片上传错误：静态图片校验不成功 */
	ERROR_0104004("0104004", "动态图片上传错误：静态图片校验不成功"),

	/** 未知错误类型 */
	ERROR_99xxxxx("99xxxxx", "未知错误类型");//

	private String code;
	private String message;

	private ProtocolErrorCode(String code, String message) {
		this.code = code;
		this.message = message;
	}

	public String getCode() {
		return this.code;
	}

	public String getMessage() {
		return this.message;
	}
}
